profiling/results/stage-5_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 4.537ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 4.568ms, rate sampling interval: 15ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.19ms    3.66ms  41.86ms   92.10%
    Req/Sec   519.29    125.35     1.44k    82.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.34ms
 75.000%    4.31ms
 90.000%    6.45ms
 99.000%   22.06ms
 99.900%   32.24ms
 99.990%   38.37ms
 99.999%   41.89ms
100.000%   41.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.513     0.000000            1         0.00
       1.811     0.100000         5010 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.249     0.200000         9994         0.00
       2.637     0.300000        14995        -0.00
       3.003     0.400000        19995        -0.00
       3.335     0.500000        24995         0.00
       3.501     0.550000        27481 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       3.671     0.600000        29993         0.00
       3.859     0.650000        32486        -0.00
       4.059     0.700000        34979        -0.00
       4.307     0.750000        37496         0.00
       4.455     0.775000        38729 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       4.647     0.800000        39978         0.00
       4.875     0.825000        41230        -0.00
       5.171     0.850000        42482        -0.00
       5.619     0.875000        43723         0.00
       5.939     0.887500        44347 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       6.455     0.900000        44970         0.00
       7.219     0.912500        45593        -0.00
       8.199     0.925000        46223        -0.00
       9.407     0.937500        46842         0.00
      10.087     0.943750        47155 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
      11.015     0.950000        47467         -nan
      11.983     0.956250        47780        -0.00
      13.183     0.962500        48091        -0.00
      14.511     0.968750        48403         0.00
      15.295     0.971875        48562 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      16.119     0.975000        48716         -nan
      17.119     0.978125        48873        -0.00
      18.143     0.981250        49031        -0.00
      19.359     0.984375        49187         0.00
      20.047     0.985938        49262 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      20.719     0.987500        49340         0.00
      21.535     0.989062        49418        -0.00
      22.415     0.990625        49497        -0.00
      23.263     0.992188        49574         0.00
      23.839     0.992969        49615 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      24.351     0.993750        49652         0.00
      25.007     0.994531        49692        -0.00
      25.615     0.995313        49730        -0.00
      26.223     0.996094        49769         0.00
      26.735     0.996484        49789 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      27.199     0.996875        49808         -nan
      27.935     0.997266        49828        -0.00
      28.655     0.997656        49848        -0.00
      29.327     0.998047        49867         0.00
      29.759     0.998242        49877 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      30.223     0.998437        49886         -nan
      31.231     0.998633        49896        -0.00
      31.759     0.998828        49906        -0.00
      32.303     0.999023        49916         0.00
      32.735     0.999121        49921 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      32.799     0.999219        49925         0.00
      33.407     0.999316        49930        -0.00
      33.855     0.999414        49935        -0.00
      34.623     0.999512        49940         0.00
      34.847     0.999561        49943 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      35.423     0.999609        49945         0.00
      35.903     0.999658        49947        -0.00
      36.351     0.999707        49950        -0.00
      37.055     0.999756        49952         0.00
      37.183     0.999780        49954 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      37.343     0.999805        49955         -nan
      37.407     0.999829        49956        -0.00
      38.175     0.999854        49957        -0.00
      38.303     0.999878        49958         0.00
      38.367     0.999890        49959 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      38.399     0.999902        49960         -nan
      38.399     0.999915        49960        -0.00
      38.463     0.999927        49961        -0.00
      38.463     0.999939        49961         0.00
      38.815     0.999945        49962 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      38.815     0.999951        49962         0.00
      38.815     0.999957        49962        -0.00
      39.583     0.999963        49963        -0.00
      39.583     0.999969        49963         0.00
      39.583     0.999973        49963 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      39.583     0.999976        49963         0.00
      39.583     0.999979        49963        -0.00
      41.887     0.999982        49964        -0.00
      41.887     1.000000        49964         0.00
#[Mean    =        4.188, StdDeviation   =        3.663]
#[Max     =       41.856, Total count    =        49964]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59980 requests in 1.00m, 4.14MB read
Requests/sec:    999.75
Transfer/sec:     70.58KB